{"pages":[{"title":"about","text":"This is my personal blog, which is used to record daily activities such as study, life, social contact, travel and so on. © 2019 周昭仰 Powered by Hexo &amp; Icarus. InfoName：周昭仰Education: 湖南工业大学2017级Blog: https://airomeo.gitee.io/GitHub: https://github.com/AiromeoGitee：https://gitee.com/Airomeo/events 联系我Tel: 17737331334E-mail: airomeo@qq.comQQ：763647004","link":"/about/index.html"}],"posts":[{"title":"Android开发中必须注意的关键细节","text":"设置android:allowBackup = false权限 不设置的危害：Android开发自动生成的AndroidManifest.xml中的allowBackup属性的含义和危险性实例讲解https://blog.csdn.net/wolfking0608/article/details/78792650 详解Android App AllowBackup配置带来的风险https://blog.csdn.net/forlong401/article/details/44241305 android:allowBackup = false后编译报错https://blog.csdn.net/github_37847975/article/details/78741725 解决：单纯加上这一句会报错，需要在application节点下加入 tools:replace=”android:allowBackup”： 例子：","link":"/3/"},{"title":"Android开源框架分享","text":"骨架屏https://github.com/sharish/ShimmerRecyclerView https://github.com/ethanhua/Skeleton https://github.com/willowtreeapps/spruce-android 一个简单、轻量、可随意定制的Android版本更新库 🚀https://github.com/azhon/AppUpdate https://github.com/azhon/AppUpdate","link":"/2/"},{"title":"Summary of 30 days in IDL","text":"2018.11.18-2018.12.17 ——Thirty Days IDL 六月，是花的季节。“全国唯一没有单身狗的大学”是我第一次与IDL相遇。自此，仿佛世界豁然开朗，兴趣发现了另一片天空。7月开始默默关注着IDL的动态，直到一个月前，11月，将我的简历发给了IDL。两轮筛选，很幸运，自己成功进入IDL大家庭，成为实验室的预备成员。11.18 7.00PM，新老成员见面会，算是第一次正式进入505这个房间吧，复试的时候比较仓促，而且紧张的没敢仔细看看505。人很多，每个人都是大佬，水果、饮品、披萨，畅饮哈哈哈。505给我的感觉就像是生活大爆炸里面家的感觉，NICE。 师徒配对：邱……邱总 左师傅右徒弟 新兵营，接下来的30天真的不轻松。30天的打卡作业： 一半编程，一半PS。 Day 1，签到卡。 Day 2~6，每天坚持收集20张海报。复习《第一行代码》，写天气App。原定2天写完，连续肝了两天4点，没写完……然后就又水了两三天才写完。 Day 6~16，每天坚持收集20张海报。了解学习水滴清单代码，学习MVP和MVVM架构，从第14天开始，仿照水滴清单写一些简单的界面。 Day 17~18，从前面n天收集的海报中分两批各选20张，回头看真的是可以看得见进步，感觉最开始几天收集的海报好low，第一天选2~11天，还比较好选，没纠结多久。第二天选12~16天的海报，纠结了1小时多，感觉一些海报真的很不错。 Day 19~30，每天在doyoudo上找一期有趣的PS教程，每天跟着学学p图，学到现在，不敢称大佬，稍稍改改图片还行。 Day++；刚进入505，对这个新环境不太了解，随着时间过去，越来越感觉到周围的几个都是大佬，tql，我的天，各个领域都有涉及。 30天的打卡 作业都在底部的gallery 天气 输入法皮肤这里给自己打个广告蓝兰v2.02018.12.17极简，耐看，高分屏，黑白蓝三色，md风格。 自己2月份的时候设计了这个皮肤v1.0，今天重新改版，重新设计了一下，增加圆角矩形，针对4种输入模式均做适配。名字就叫蓝兰吧，很随意的懒。 哦对还有我的吊兰，依旧活的安逸。吊兰的花语：无奈又给人希望。活在当下，暑假接手养到现在，期间倒腾过几次，一个月基本没管，也坚强的活了下来。生活就是这样奇妙，很普通很寻常往往很惊喜，很安静很温柔往往很高贵。我喜欢动物植物，但不敢养，怕没时间照顾，最后失去。又像恋人又分手，心里难受不是滋味。兰兰你要加油！静待开花！ 师傅教我“善用工具”，也是发现了几款好软。For me，一款软件就像是一片领域的一枚开门钥匙。未完待续。。。。。。 下面是30天的所有作业","link":"/4/"},{"title":"hexo 使用子模块实现自定义主题与hexo文件分离，在两个git维护","text":"以前我们已经设置并发布了基于hexo的博客。文章源代码和hexo配置文件在git版本控制下。现在我们想把整个本地hexo的配置文件等等全部托管到远端仓库，相当于备份。但是git add . 不会把我们hexo里面的themes目录下我们自己设置的主题同步上去，因为这个主题可能是我们从别的地方clone或下载的，包含了别人的git信息。因此本文来实现将别人的themes托管到远端仓库，实现自定义主题与hexo文件分离，在两个git维护。 配置主题，错误的方式与大多数hexo教程一样，下一步是更改默认主题。有很多主题可供选择。但是，大多数主题只是要求您在themes文件夹下克隆自己。 在这种情况下，我们将使用流行的主题NexT。其文件指定如下： 安装 git clone https://github.com/iissnan/hexo-theme-next themes/next 更新_config.yml以使用此主题 theme: next 在需要时拉主题更新 cd theme/next git pull 问题对于大多数主题（包括NexT），我们必须修改主题文件夹下的主题_config.yml文件，以便： 更改主题级别的配置，例如更改主题样式 更新个人信息 设置Google Analytic密钥 与第三方评论插件集成 未来以您想要的方式定制主题 当然，您希望在版本控制下进行上述修改，因此您可以检查它们并推送到Git。 现在，如果您前往Github源代码页，您会发现一个名为“Next”的有趣的灰色文件夹。 您也失去了在那里浏览主题源代码的可能性。 根本原因从技术上讲，我们创建了一个嵌套的git存储库结构：git存储库“Blog-Hexo”下面有一个git存储库“Next”。这个git文档对此有一个很好的解释。 正确的方式由于我们的自定义主题成为博客系统的独立组件，因此需要对其进行适当的版本控制。 Fork主题项目通过这样做，您可以正确地控制对主题的修改，但仍然可以使其保持最新状态。fork版本是https://github.com/linkcd/hexo-theme-next。 创建名为“next-linkcd”的Git子模块（意味着它是我们自己的NexT主题版本），并指向https://github.com/linkcd/hexo-theme-next。 cd blog-hexo git submodule add https://github.com/linkcd/hexo-theme-next themes/next-linkcd 请求hexo使用我们自己的主题 theme: next-linkcd 现在您有2个独立的存储库，一个用于您的blog-hexo，另一个用于您自己的主题。您可以运行以下命令来查看关系。 它也适用于Github网页 请注意，两个地方的“git戳”是d82e379。 自定义主题现在您可以自由修改主题了。要将主题更改推回Github，请按照以下步骤操作： Git添加，提交并推入next-linkcd文件夹 Git添加，提交和推送blog-hexo文件夹，即使您没有修改博客中的任何内容。 补充在实际使用的时候，理论上会有3个仓库，一个是我们搭建的hexo博客仓库，一个是我们备份的本地hexo仓库，另一个是这个仓库的子模块（submodule），也就是我们fork的主题仓库。使用时，我们会对主题进行或多或少的修改，因此修改后的主题我们可以通过git同步到远端仓库。本地备份的hexo仓库一般改动不大，用git备份到远端仓库即可。平时写文章我们搭建的博客会改动，所以需要hexo clean，hexo s来推送到远端git仓库。 两台PC之间同步 cd blog-hexo git pull git submodule update 在新PC中恢复您的博客 从Github恢复源代码 git clone https://github.com/linkcd/blog-hexo.git cd blog-hexo git submodule update –init 重新安装hexo程序。无需重新安装插件。 cd blog-hexo npm install hexo npm install 完成 本文参考fenglu大佬的文章，原文为英文，自己翻译过来，并加入自己使用时遇到的问题以及分析过程总结，侵删转注","link":"/6/"},{"title":"Hello World","text":"Formally Create Wordpress Blog Write down this sentence.”Celebrate the first article.” 2019-01-13 15:00:20 Create a hexo blog and officially transfer to hexo Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/1/"},{"title":"影评：《人生果实》——津端夫妇纪录片","text":"影评：《人生果实》——津端夫妇纪录片–原书《积存时间的生活》 《明天也是小春日和》：这是一本记述 津端夫妇田园生活的随笔。为了一圆妻子英子多年的田园梦，津端修一老先生在退休后带着英子远离都市的喧嚣，归隐乡间，用几十年时间悉心打理着自家的木屋和菜园，调配泥土，种植蔬菜，研究食谱，腌制食物……任窗外风景随四季更迭，有彼此陪伴的每一天都是好天气。他们在身体力行中向人们展示了一种优雅的生活方式，道出了几十年幸福婚姻的秘诀。 津端英子 （1928.1.18 ~ ），一九五五年与津端修一结婚，婚后专注于家庭生活，擅长料理、纺织、刺绣、耕田等。 津端修一 （1925.1.3 ~ 2015.6.2），建筑师，学者。毕业于东京大学，先后在建筑师安托宁·雷蒙德、坂仓准三等事务所工作，后担任广岛大学教 授等职。劳作之余担任“自由时间评论家”。 一位87岁，一位90岁（根据片中拍摄时间） “风吹落枯叶枯叶滋养土壤肥沃的土壤帮助果实缓慢而坚定的生长” 也不是对此片早有所闻，春晚前不知道看什么，习惯性的点开高分榜看看有没有什么电影。一开始看到《人生果实》这部纪录片没想点进去，但看在评分挺高，9.4分，还是点了进去。纪录片都是没有华丽的开头，也不认识津端夫妇，刚开始有点无聊，不过看着看着就被吸引了，繁华城市中的慢节奏生活，相依60载的他们，都是我向往的生活。 片中 鸟盆“请自便” 年轻时，酷爱帆船和航海的建筑师修一为了圆妻子的田园梦，带着英子来到这里，亲手为她搭起了田园木屋、开辟了菜园果园。修一常说：城市需要森林。他觉得一个人想要好好生活，不能远离树木。于是在木屋西面种了 180 棵树。他们和这里的50多种水果、70多种蔬菜和180棵树已经生活了40多年。除了自耕自种，基本上一切吃食都是在家自己动手完成。英子女士小时候肠胃不好，吃妈妈做的饭菜长大。后来结婚，两人都不喜欢下馆子，只能在家做，慢慢地什么都可以做出来，还颇有心得。既找到了动手的乐趣，还延续了记忆中的味道，最后变成津端家的特色。 女儿的名字是花子，爱好击剑小时候她想要娃娃屋，想要的是商店中特别受欢迎的那种大型塑料娃娃屋，但外公说“禁止塑料”，所以就用木材亲手做了这个。 可拆卸屋顶，大型入口，里面有架子三张婴儿床，小型号，把婴儿放在上面悬挂的身高测量器，可爱，悬挂起来，还标注了“需要图形”。 当所有的家人都聚在一起，我们就会升起这面旗帜，就像战场上那样，那些旗帜说“尽你们最大的努力” “修一喜欢明亮和彩色，所以我们的女儿做了“彩旗串”来纪念他。”“流泪是不行的，我试着不哭”英子忍不住啜泣开来。 六十多年的朝夕相处，英子从来没有变过，说起自己最舒心的事情就是丈夫过得好。那个很冷的冬天，他们结婚了，没有婚礼。一直拥有帆船梦而月薪只有4w日元的修一，告诉英子买一条帆船大概70w日元。英子平静地说：这样啊。然后就觉得那就想想办法吧。然后她把保险全部解约，家里值钱的东西都被她一趟一趟拿着去了当铺。而修一全不知情。英子说这种事不能告诉他。 “修一，你会不会思考自己的结局？”“不会的”“我有时候会想”“那没用的”“如果我先走，你会怎么做？我很好奇。我并不是担心，但是，到了我们这种年纪，谁也不知道谁会先离开” 2015年6月2日，津端修一在除草后小睡后再也没醒一切镜头都安静了英子在他旁边静静的端详，不断地抿着嘴。在床前桌上把花插上。 “修一，我会把一切都安排好的，所以别担心了”“等我时候到了，变成了灰烬，我们就可以一起乘船去南太平洋了，等着我，好吗。”xx摸着修一的头，抽泣道。“你会孤单一人，但是，好好照顾自己，等着我。我会尽最大的努力，期待着再次见到你”。镜头沉默在了修一先生再也不会睁开的眼睛。是整个纪录片的高潮，却格外低沉，没有刻意煽情，而是轻描淡写地，甚至给了修一先生的遗体长达半分钟的特写镜头，他的表情是那样平静安详。所有的画面都沉默了，只有英子抽泣的声音。非常令人震撼。死亡也是生命的一部分，珍惜死亡，才更珍惜活着的现在。 早上天气不错，英子的心情似乎也很不错。在镜头沉默许久后，一天重新开始。“我很后悔，我该让他吃的更好些”“修一，早饭好了”英子把早饭端到修一的照片前。英子开始一个人吃饭。讲着怀念他的话。 在八月的土豆上撒上落叶，用棍子打开修一关闭的窗户，“修一喜欢明亮的感觉” 18号台风来了，过后一片狼藉。地上满是松果、板栗、落叶、树枝。花子叫人把路边电线旁的树枝砍了。“我只让人切了这边，避免妨碍到别人”“我请求修一原谅我，但他会抱怨我，他刚走我就这样做” “妈妈，水盆烂了”花子很难受，“想点积极的东西，别抱怨。”“我们就当它是时候到了”。英子安慰花子。 修一爷爷90岁时还曾帮一家医院设计图纸，并拒绝一切谢礼和设计费。接到医院的求助后，只用两天就做好了设计。修一爷爷在笔记中写“比起金钱，人更重要”“只要还活着，就想要尽力做到最好。”勤奋而优雅，这就是年老时最理想的模样吧。 “从自己能做得到开始，一件件来，缓慢而坚定地前进，慢慢来”“对我来说，这是我人生中唯一的项目。只要我活着，我就会尽力而为”八个月后，他的项目开始实地施工建设。 “这是热的，请吃吧”英子依旧照常把早餐端给修一，旁边是他用的木勺。 “他总是告诉我要缓慢而坚定的做自己能做的事情，我是这样做的，而且我一意识到这一点很重要。一旦我这样做了，我就会开始看到很多事情” 音乐起，又是那经典的话 “风吹落枯叶枯叶滋养土壤肥沃的土壤帮助果实缓慢而坚定的生长” 怎么说，看完这部影片内心没有大的感动，但就是很欣慰，小小的羡慕。津端夫妇那样的生活也是我想要的生活，一片土地，自己种植喜欢的东西，自给自足。时而尝试做一些新的佳肴，学一学厨艺。一年四季窗外都是景。爱折腾，有自己的房间，类似美国的车库。此外能养一只小狗（不想养猫，因为刚被他咬伤）。不像是楼房，一栋栋高楼，楼上楼下都一模一样，混凝土的墙壁冷冰冰，没有一点温度。然而现实是向往的生活越来越远，现实生活又难以改变，想要突破又没得勇气，最终无奈屈从。跑偏了，跑偏了。除了建筑风格，导演安排了很多细节处的镜头，鸟盆、肥料落叶、土豆、大树、快递、窗纸、窗户、风向标、旗帜，等等等等。可能你现在看到的画面不知不觉在后面片中的某一个镜头再次出现，却有所不同。或是美好的存在，或是遗憾的惋惜。除此之外，影片极尽可能塑造二老形象，除细节的衬托，儿女、事业等重要的事也没有过多的镜头，有的也是对“主”的体现。不得不说导演是真的用心。当然，最重要的也是二老的感情，六十多载，87+90=177，没有彼此的默契是无法走到这一步的，今年我才20，算不上有感情经历，又没情商，对感情又不敏感，嫩说得出口的道理又不是发自心中的真实想法，便不做评论，只羡慕二老，祈求自己在感情上能“长大”。这部片子现在看完虽有反思，但没有那么大，可能因为我还年轻，等数年后再看，或许有更多的感受。豆瓣上相关的纪录片还有《树木希林》，在看别人的影评的时候也提及了这部影片这个人，等日后有空，欣赏一下。 影片最后，第三次切到鸟盆的镜头。 修复的鸟盆“请自便”人生果实 毕 参考部分豆瓣影评，部分图片来自网络，侵删","link":"/5/"}],"tags":[{"name":"Android","slug":"Android","link":"/tags/Android/"},{"name":"IDL","slug":"IDL","link":"/tags/IDL/"},{"name":"hexo","slug":"hexo","link":"/tags/hexo/"},{"name":"影评","slug":"影评","link":"/tags/影评/"}],"categories":[{"name":"Study","slug":"Study","link":"/categories/Study/"},{"name":"Coding","slug":"Study/Coding","link":"/categories/Study/Coding/"},{"name":"Life","slug":"Life","link":"/categories/Life/"},{"name":"Movies","slug":"Life/Movies","link":"/categories/Life/Movies/"}]}